xfire-sandbox/xfire-ws-security/src/test/org/codehaus/xfire/security/sample-wsse-request.xml

<soapenv:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soapenv:Header>
    <wsse:UsernameToken>
      <wsse:Username>cupareq</wsse:Username>
      <wsse:Password>cupareq1</wsse:Password>
    </wsse:UsernameToken>
  </soapenv:Header>
  <soapenv:Body>
    <m:echo xmlns:m="urn:Echo">
      <m:text>Yo Yo</m:text>
    </m:echo>
  </soapenv:Body>
</soapenv:Envelope>
